import { MRichText } from "../../../../../frame/util/RichLabelUtil";
import {ViewBase} from "../../../../../frame/view/ViewBase";
import { ui } from "../../../../../ui/layaMaxUI";
import { ZipJson } from "../../../../static/ZipJson";

export class GongGaoView extends ViewBase{
    private _ui:ui.views.shezhi.ui_gonggaoUI;
    protected mMask = true; 

    protected onAddLoadRes() {
        this.addAtlas('shezhi.atlas');
    }

    protected onFirstInit(){
        if(!this.UI){
            this.UI = this._ui = new ui.views.shezhi.ui_gonggaoUI;
            this._ui.lab_text.width = 490;
            this.bindClose(this._ui.close1);
        }
    }

    protected onInit() {
        this.upDataView();
    }

    protected onExit() {

    }

    private upDataView(){
        // let st = "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是";
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"
        // st += "士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是士大夫士大夫士大夫随风倒手动阀手动阀士大夫士大夫士大夫商队士大夫撒旦发射点发士大夫的撒旦士大夫顺丰速递是"

        let re:MRichText = new MRichText;
        re.SetContent("测试用");
        re.SetFontFamily(ZipJson.BOLD);
        re.SetFontSize(24);
        this._ui.lab_text.innerHTML = re.HTMLText;
        // this._ui.lab_text.innerHTML = "<span style='bold:true;font-size:40px;color:#00ff00'>xxx</span><br><span style='font-family:BOLD;font-size:26px;color:#00ff00'>是否花费手动阀手动阀双方的是</span>";
    }
}